# @Time: 2020/8/11 14:47
# @Author: zhangyangyang
# @Software: PyCharm
# @description: 正则解析数据
'''
priceTime   发售时间
bidDocument 发售地点
openTime    开标时间
address     开标地点
company     采购人名称/单位
bidDeadline 投标截止时间
noticeTime  公告期限
budget 预算金额
project 项目名称
day 爬取日期（天）
title 公告标题
'''
"""
通过re_开头的则是通过p标签，一段一段匹配的，可能正则无法获取到（数据规整的直接加在这里）
通过re_parse_开头的则是通过整段匹配文字，处理p段落无法获取时的情况（数据格式乱的则在这里处理）
"""
# 项目名称
re_project = [
    '项目名称：(?P<project>.*)'
]
# ------------------------------------------------ 预算金额
# 预算金额
re_parse_budget = [
    '\d+\.\d+万元（人民币）',
    '项目预算金额：(.*)。本项目执行最高限价人民币',
    '最高限价：(.*)5、采购需求',
]
# 预算金额
re_budget = [
    '财政预算金额：(.*)'
    '本项目预算及最高投标限价金额(.*)',
    '本项目总预算金额及最高限价：(.*)',
    '预算金额及最高限价：(.*)',
    '预算及最高限价(.*)',
    '\d+\.\d+万元',
    '\d+万元',
    '合同估算价(.*)',
    '预算金额：(.*)',
    '招标预算：(.*)',
    '项目预算\d+(\d+.*)',
    '项目金额.(.*)',
    '预算资金.(.*)',
    '合同金额：(.*)',
    '最高限价：(.*)',
    '工程概算投资额(.*)'
    '(\d+,\d+\.\d+元)，',
    '(\d+\.\d+元)，',
    '(\d+\.\d+元)',
    '\d+\.\d+（万元）',
    '\d{2,7}\.\d+',
    '(\d+元)，',
    '\d{8}'
]
# ------------------------------------------------ 公告期限
# 公告期限
re_noticeTime = [
    '公告期限：(.*)',
    '公示期限：(.*)',
    '公告日期：(.*)',
    '自本公告发布之日起\d个工作日',
    '招标公告期限为(.*)',
    '自招标公告发布之日起\d个工作日',
]
# 整段处理时：公告期限
re_parse_noticeTime = [
    '公告期限(.*)..其他补充事宜',
    '公示期限为(.*?；)',
]
# ------------------------------------------------ 招标文件发售时间及地点
# 发售时间以及发售地点
re_parse_priceTimeAndbidDocument = [
    '三、.*提交投标文件截止时间',
    '三、.*响应文件提交',
    '获取招标文件.*提交投标文件截止时间',
]
# 发售时间
re_parse_priceTime = [
    '时间：(.*)2. 地点',
    '时间：(.*)2.地点',
    '时间：(.*)3.2地点',
    '时间：(.*)地点：',
    '.*（北京时间，法定节假日除外）',
]
# 发售时间
re_priceTime = [
    '招标文件发售时间：(.*)',
    '发售时间：(.*)',
    '发售时间:(.*)',
    '购买招标文件时间：(.*)',
    '时间：(.*)',
    '请于(.*)时，',
    '获取磋商文件时间：(.*)',
    '投标人报名时间：(.*)',
    '凡有意参加投标者，请于(.*)时，在'
]
# 发售地点
re_parse_bidDocument = [
    '地点：(.*)3\.',
    '地点：(.*)方式',
]
# 发售地点
re_bidDocument = [
    '发售地点：(.*)',
    '文件地点：(.*)',
    '购买地点：(.*)',
    '时，在(.*)（详细地址）持以下资料购买招标文件'
]

# ------------------------------------------------ 开标有关信息
# (截取这一段文字，用于提取开标时间截止时间和地点)
re_parse_address__openTime_bidDeadline = [
    '开标时间和地点(.*)五、',
    '开标时间和地点(.*)六、',
    '.、开启(.*).、公告期限',
]
# 投标截止时间
re_bidDeadline = [
    '提交投标文件截止时间、开标时间：(.*)',
    '投标文件截止时间、开标时间：(.*)',
    '投标截止时间：(?P<bidDeadline>.*)',
    '递止截止时间：(?P<bidDeadline>.*)',
    '响应文件截止时间：(.*)',
    '（投标截止时间）为(.*?，)',
    '投标文件递交的截止时间(.*分，)',
    '投标文件截止时间：(.*)2、提交投标文件地点',
    '投标文件截止时间.*(\d.*（北京时间）)',

]
# 整段处理时：截止时间
re_parse_bidDeadline = [
    '开标时间和地点：(.*)（北京时间），',
    '时间：(.*)（北京时间）',
    '.*（北京时间），',
    '(.*)地点',

]

# 整段处理时：开标地点
re_parses_address = [
    '地点.(.*)',
    '地点为(.*)（详细地址）。'
]
# 整段处理时：开标时间
re_parse_openTime = [
    '(时间.*)（北京时间）',
    '开标时间：(.*?，)',
    '(.*)地点',
    '.*（北京时间），'
]
# 开标时间
re_openTime = [
    '开标时间：(.*?，)',
    '开标时间：(.*?。)',
    '开标时间：(.*?；)',
    '开标时间：(?P<openTime>.*)',
    '开标时间和地点(.*)地点',
    '时间：(即日起至.*?。)',
    '开启及磋商时间：(.*（北京时间）)',
    '提交投标文件截止时间、开标时间：(.*)'
]
# 开标地点
re_address = [
    '投标和开标地点：(.*)',
    '开标地点：(?P<address>.*)',
    '开标时间和地点.*地点(.*)',
    '响应文件开启地点：(.*)',
    '开标地点：(.*)',
    '开标时间和地点：(.*)（如有变动另行通知）'
]
# ------------------------------------------------ 代理机构有关信息
# (截取这一段文字，用于提取代理机构单位名称、联系人、电话信息)
re_parse_daili = [
    '：代理机构：.*代理机构地址：',
    '供应商（乙方）：(.*)六、合同主要信息',
    '采购代理机构联系方式：(.*)7. 采购项目',
    '5.采购代理机构地址(.*)二.项目概况',
    '2.采购代理机构名称(.*)3.项目联系方式',
    '2.采购代理机构信息（如有）(.*)3.项目联系方式',
    '采购代理机构信息(.*)3.项目',
    '采购代理机构信息(.*)7.3项目联系',
    '2采购代理机构信息(.*)电子信箱',
    '、采购代理机构信息：(.*)十、发布媒介',
    '采购代理机构信息：(.*)开户名：北京市京发招标有限公司',
    '招标代理机构信息(.*)3.项目联系',
    '联系方式(.*)招标人联系方式',
    '、采购代理机构信息：(.*)十.、发布媒介'

]
# 代理机构
re_parse_agency = [
    '代理机构：(.*)代理机构联系人：',
    '名      称：(.*)地',
    '招标代理：(.*)地',
    '名称：(.*)地址',
    '单位名称：(.*)地',
    '名\xa0\xa0\xa0\xa0称：(.*)地',
    '名\xa0称：(.*)地',
    '名 称：(.*)地',
    '招标代理：(.*)',
    '名 称：(.*)',
    '名 称:(.*)',
    '名称：(.*)地',
    '代理机构：(.*)',
    '名    称：(.*)',
    '(名.*)地',
    '名称：(.*)地址',
]
# 代理机构联系人
re_parse_agency_person = [
    '代理机构联系人：(.*)代理机构地址',
    '联系人：(.*)电话',
    '联系人：(.*)6.4',
    '联系人：(.*)联系',
    '联系人姓名：(.*)电',
    '联系人：(.*)联系方式',
    '联系人：(.*)联系',
    '联 系 人：(.*)',
    '联系人：(.*)',
]
# 代理机构联系人
re_agency_person = [
    '采购代理机构联系人：(.*)',
    '代理机构联系人：(.*)',
    '采购代理机构联系人及联系方式：(.*)',
    '代理机构联系人：(.*)代理机构地址'
]
# 代理机构联系方式
re_parse_agency_telephone = [
    '联系人及联系电话：(.*)',
    '联系电话：(.*)邮箱',
    '电      话：(.*)传',
    '电    话：(.*)传',
    '联系方式：(.*)E-mail',
    '联系方式：(.*)邮箱',
    '联系方式：(.*)',
    '电　　话：(.*)',
    '联系方式:(.*)',
    '电    话：(.*)',
    '电话：(.*)',
    '联系方式：(.*)',
    '联系电话：(.*)'
]
# 代理机构联系方式
re_agency_telephone = [
    '采购代理机构联系方式：(.*)',
    '采购代理机构联系人及联系方式：(.*)',
    '代理机构联系人及联系方式：(.*)',
    '代理机构联系方式：联系人：(.*)'
]
# 代理单位名称
re_agency = [
    '采购代理机构全称：(.*)',
    '采购代理机构：(.*)',
    '代理机构：(.*)',
    '代理机构名称：(.*)',
    '采购代理机构名称：(.*)',
    '供应商（乙方）：(.*)',
    '采购代理机构全称：(.*)',
    '招标代理人：(.*)',
    '采购代理机构名称:(.*)',
    '招标代理：(.*)',
    '代理机构：(.*)代理机构联系人',
]

# ------------------------------------------------ 采购单位相关信息

# (截取这一段文字，用于提取采购人单位名称、联系人、电话信息)
re_parse_caigou = [
    '：采购单位：.*代理机构联系方式：',
    '二、采购人名称(.*)三、采购代理机构全称',
    '1.采购人名称：(.*)2.采购代理机构名称：',
    '五、合同主体(.*)供应商（乙方）',
    '采购单位联系方式：(.*)代理机构联系方式：',
    '采购人联系方式：(.*)采购代理机构联系方式：',
    '项目联系方式：(.*)代理机构联系方式：',
    '项目联系方式：(.*)采购代理机构：',
    '采购人名称：(.*)2. 采购代理机构全称',
    '项目联系方式：(.*)采购代理机构：',
    '(单位的价格给予扣除.*)代理机构名称：',
    '采购人联系方式：(.*)6.采购代理机构联系',
    '采购人联系方式：(.*)15.凡对本次采购',
    '采购人信息(.*)2采购代理机构信息',
    '采购人信息(.*)7.2采购代理机构信息',
    '采购人信息(.*)..采购代理机构信息',
    '招标人信息(.*)..采购代理机构',
    '、采购人信息：(.*)十.、',
    '采购人地址：(.*)6、代理机构名',
    '采购单位联系方式：(.*)政府集中采购机构联系',
    '招标人联系方式(.*)8、采购项目需要落实',
    # '采购.*采购代理机构',
    '采 购 人：(.*)采购代理机构全称：',
    '采 购 人： (.*)'

]
# 采购单位名称
re_company = [
    '采购人名称：(.*)',
    '采购人：(.*)',
    '采购单位: (.*)',
    '采购人（甲方）：(.*)',
    '采购单位：(.*)',
    '招 标 人(.*)',
    '招标人（项目业主）为(.*?，)',
    '招标人：(.*)'
]
# 采购人联系方式
re_purchase_telephone = [
    '4. 代理机构联系方式(.*)',
    '采购单位联系方式：(.*)',
    '采购人及联系方式：(.*)',
    '采购人联系方式：(.*)',
    '采购人联系人、联系方：(.*)',
    '采购人电话：(.*)',
    '联系人及联系方式：(.*)',
    '联系人及联系电话：(.*)',
]
# 采购人姓名
re_purchase_person = [
    '采购人及联系方式：(.*)',
    '采购人联系人、联系方：(.*)',
    '采购人姓名：(.*)',
    '采购人联系人：(.*)',
]

# 采购人单位名称
re_parse_company = [
    '采购单位：(.*)地址：',
    '招标人：(.*)单位',
    '名    称：(.*)地',
    '名称：(.*)地址',
    '名 称：(.*)地址',
    '名 称:(.*)地址',
    '名称：(.*)地',
    '称：(.*)地',
]
# 采购单位联系人
re_parse__purchase_person = [
    '联系人：(.*)传真：',
    '项目联系人：(.*)联',
    '联系人：(.*)电',
    '联系人：(.*)传',
    '联 系 人：(.*)电',
    '联系人姓名：(.*)电',
    '采购人及联系方式：(.*)',
    '联 系 人：(.*)',
    '联系人：(.*)',
]
# 采购单位联系方式
re_parse__purchase_telephone = [
    '采购人联系方式：(.*)',
    '电话：(.*)采购代理机构名称：',
    '电话：(.*)采购代理机构',
    '联系方式：(.*)7\.',
    '联系电话：(.*)邮',
    '电    话：(.*)联',
    '电   话：(.*)采购',
    '电话：(.*)十',
    '电      话：(.*)',
    '采购人联系方式：(.*)',
    '采购人及联系方式：(.*)',
    '联系电话：(.*)',
    '联系方式：(.*)供应商',
    '联系方式：(.*)',
    '联系方式:(.*)',
    '电话：(.*)',
    '联系方式：(.*)',
    '电    话：(.*)',
    '电   话：(.*)',
    '电话：(.*)',

]
# ------------------------------------------------ 采购需求
# 采购需求
re_purchase_demand = [
    '采购需求：(.*?。)',
    '采购需求：(.*)合同履行',
    '采购需求：(.*)详见招标文件）；'
]
